/***********************************************************************************************************************
 * Created by sunlit on 2018/3/30
 * Info: 服务器响应状态
 * UpdateTime：
 * UpdateReason：
 * * 每次重大修改请追加详细变更记录 *
 *
 **********************************************************************************************************************/
export default{
    SUCCESS:            100,    // 成功
    ERROR_API:          101,    // 接口不存在
    ERRPR_MIME_TYPE:    102,    // 后缀名错误
    ERROR_EMPTY_BODY:   103,    // 空请求体
    ERROR_REQ_TYPE:     104,    // 请求方式错误
    ERROR_PARAM:        105,    // 参数错误
    ERROR_DATA_DECRYPT: 106,	// 数据解密错误
	ERROR_DATA_RESOLVE: 107,	// 数据解析错误
	ERROR_REQ:          108,	// 接口请求失败
	ERROR_INTERNAL:     109		// 服务器内部错误
}